# RemoveSize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizes..::..RemoveSize Method
CableTraySizes Class See Also
---
Erases the existing MEPSize. For cable tray, the nominal diameter is used in MEPSize.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void RemoveSize(
	MEPSize sizeInfo
)
```

Visual Basic
---
```text
Public Sub RemoveSize ( _
	sizeInfo As MEPSize _
)
```

Visual C++
---
```text
public:
void RemoveSize(
	MEPSize^ sizeInfo
)
```

# ### Parameters
sizeInfo
    Type: Autodesk.Revit.DB..::..MEPSize The MEPSize to be removed..
# Remarks
Does nothing if there is no existing MEPSize with the specified nominal diameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Throws if the function is called during iterating the size set. |

# See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace